# -*- coding: utf-8 -*-

"""
==================================================
不管用哪种方法的getter、setter，都要继承自object
==================================================
"""

class Test2(object):
	def __init__(self):
		self.__num = 222

	"""
	==================================================
	@property来标志为getter
	==================================================
	"""
	@property
	def num(self):
		return self.__num

	"""
	==================================================
	@{x}.setter来标志为setter
	==================================================
	"""
	@num.setter
	def num(self, num):
		self.__num = num

#==================================================
obj1 = Test2()
print(obj1.num)
obj1.num = 2222
print(obj1.num)
