# -*- coding: utf-8 -*-

"""
==================================================
不管用哪种方法的getter、setter，都要继承自object
==================================================
"""

class Test1(object):
	def __init__(self):
		self.__num = 111

	"""
	==================================================
	方法名没规定
	推荐用get开头
	==================================================
	"""
	def getNum(self):
		return self.__num

	"""
	==================================================
	方法名没规定
	推荐用set开头
	==================================================
	"""
	def setNum(self, num):
		self.__num = num

	"""
	==================================================
	方法名没规定
	推荐用del开头
	==================================================
	"""
	def delNum(self):
		del self.__num

	"""
	==================================================
	property(getter, setter)来注册getter、setter

	这是其中一种方法
	==================================================
	"""
	num = property(getNum, setNum, delNum)

#==================================================
obj1 = Test1()
print(obj1.num)

obj1.num = 1111
print(obj1.num)

#删除后，再print就报错了
del obj1.num
print(obj1.num)
